export const CreatePipelineModules = [
  [
    { label: 'Оценка эффективных объемов пород' },
    { label: 'Оценка ВНК' },
    { label: 'Оценка геометрического объема ловушки' },
    { label: 'Оценка Кн' },
    { label: 'Оценка объемного коэффициента' },
    { label: 'Оценка по плотности запасов' },
    { label: 'Оценка ВГТРК' },
    { label: 'Оценка гомеопатического объема психушки' },
    { label: 'Оценка SS' },
  ],
  [
    { label: 'Оценка геологических рисков по 5-ти факторной модели' },
    { label: 'Создание произвольной модели рисков' },
    { label: 'Оценка вероятности успеха ПРБ' },
  ],
  [
    { label: 'Выбор типового объекта разработки' },
    { label: 'Оценка минимально-рентабельных толщин' },
    { label: 'Оценка профиля добычи нефти по темпам падения' },
    { label: 'Оценка профиля добычи газа' },
  ],
  [
    { label: 'Определение точек сдачи продукции' },
    { label: 'Расчет САРЕХ' },
    { label: 'Расчет ПНГ' },
    { label: 'Расчет электричества' },
  ],
  [
    { label: 'Расчет налогов' },
    { label: 'Оценка САРЕХ' },
    { label: 'Оценка ОРЕХ' },
    { label: 'Подготовка базовой ФЭМ' },
  ],
  [
    { label: 'Создание программы ГРР' },
    { label: 'Создание программы ОПР' },
    { label: 'Размещение эксплуатационного фонда' },
    { label: 'Задание правил строительства инфраструктуры' },
    { label: 'Сосиздание во имя Господа Нашего Иисуса Виссарионовича Христа' },
    { label: 'Формирование ОПГ' },
    { label: 'Размещение объявлений на подъездах' },
    { label: 'Здание правил строительства инфраструктуры' },
  ],
  [
    { label: 'Задание условий моделирование' },
    { label: 'Задание правил выгрузки результата' },
    { label: 'Настройка экспорта данных' },
    { label: 'Настройка выбора и просмотра сценариев' },
  ],
];

export const PreviewPipelineModules = [
  {
    modules: [
      { 
        label: 'Оценка эффективных объемов пород',
        status: 'success'
      },
      { 
        label: 'Оценка ВНК',
        status: 'success'
      },
      { 
        label: 'Оценка геометрического объема ловушки',
        status: 'success'
      },
      { 
        label: 'Оценка Кн',
        status: 'success'
      },
      { 
        label: 'Оценка объемного коэффициента',
        status: 'success'
      },
    ],
    progress: '100%',
    success: '100%',
  },
  {
    modules: [
      { 
        label: 'Оценка геологических рисков по 5-ти факторной модели',
        status: 'inProgress'
      },
      { 
        label: 'Создание произвольной модели рисков',
        status: 'success'
      },
      { 
        label: 'Оценка вероятности успеха ПРБ',
        status: ''
      },
    ],
    progress: '66%',
    success: '33%',
  },
  {
    modules: [
      { 
        label: 'Выбор типового объекта разработки',
        status: ''
      },
      { 
        label: 'Оценка минимально-рентабельных толщин',
        status: 'inProgress'
      },
      { 
        label: 'Оценка профиля добычи газа',
        status: ''
      },
    ],
    progress: '33%',
    success: '',
  },
  {
    modules: [
      { 
        label: 'Расчет САРЕХ',
        status: ''
      },
      { 
        label: 'Расчет ПНГ',
        status: ''
      },
      { 
        label: 'Расчет электричества',
        status: ''
      },
    ],
    progress: '',
    success: '',
  },
  {
    modules: [
      { 
        label: 'Расчет налогов',
        status: ''
      },
      { 
        label: 'Оценка САРЕХ',
        status: 'inProgress'
      },
      { 
        label: 'Оценка ОРЕХ',
        status: 'inProgress'
      },
      { 
        label: 'Подготовка базовой ФЭМ',
        status: ''
      },
    ],
    progress: '50%',
    success: '',
  },
  {
    modules: [
      { 
        label: 'Создание программы ГРР',
        status: ''
      },
      { 
        label: 'Создание программы ОПР',
        status: ''
      },
      { 
        label: 'Сосиздание во имя Господа Нашего Иисуса Виссарионовича Христа',
        status: ''
      },
      { 
        label: 'Формирование ОПГ',
        status: ''
      },
      { 
        label: 'Размещение объявлений на подъездах',
        status: ''
      },
      { 
        label: 'Здание правил строительства инфраструктуры',
        status: ''
      },
    ],
    progress: '',
    success: '',
  },
  {
    modules: [
      { 
        label: 'Задание условий моделирование',
        status: ''
      },
      { 
        label: 'Задание правил выгрузки результата',
        status: ''
      },
      { 
        label: 'Настройка выбора и просмотра сценариев',
        status: ''
      },
    ],
    progress: '',
    success: '',
  },
];